cask_args appdir: '/Applications'

tap 'homebrew/bundle'

cask 'iterm2'
cask 'visual-studio-code'
cask 'sublime-text'

brew 'git'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'fzf'
# brew 'dep'
brew 'grc'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'yarn'
brew 'readline'
brew 'postgresql@11'
brew 'shellcheck'
brew 'spaceman-diff'
brew 'spark'
# brew 'unrar'
brew 'wget'
brew 'terminal-notifier'
brew 'chruby'
brew 'redis'

cask 'firefox'
cask 'google-chrome'
cask 'vlc'
cask 'jumpcut'

brew 'ruby-build'
# brew 'rbenv'
