cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/versions'

cask 'atom'
cask 'iterm2'
cask 'slack'
# xcode package manager
cask 'alcatraz'
cask 'jumpcut'
# window management
cask 'spectacle'

brew 'ack'
brew 'coreutils'
brew 'go15'
brew 'grc'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'shellcheck'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'git-lfs'
brew 'terminal-notifier'

## not right now
# cask 'adium'
# cask 'steam'
# cask '1password'
# cask 'firefox'
# cask 'google-chrome'
# cask 'vlc'
