cask_args appdir: '/Applications'

tap 'homebrew/bundle'

cask 'atom'
cask 'iterm2'

brew 'git'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'dep'
brew 'grc'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'nave'
brew 'readline'
brew 'postgresql'
brew 'shellcheck'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'terminal-notifier'
brew 'fzf'
cask 'firefox'
cask 'google-chrome'
cask 'vlc'
cask 'jumpcut'

## not right now
# # window management
# cask 'spectacle'

# brew 'ruby-build'
# brew 'rbenv'
